from math import gcd

my_num = 1598756544210860812002683252504666631284038535154979340910964824673923578639226397918134429192737005854188177977059177858243855990803981275665690912975534091041361701843465578101733863479781680791655959578320442108371634048374313524202193198694894536452471646868825144743014452957912743920239954473534374422647748020165306769379396190044599513110393062461302839244356754741065320775011514774723155863731595182892822790709843296375075272651902641460504103291775361
var = 0
num = 0

with open('nums.txt') as f:
    for line in f:

        if line[0] == 'n':
            num = int(line[3: -2])
            gcd_num = gcd(my_num, num)
            if num != my_num and gcd_num != 1:
                tmp = my_num // gcd_num
                print("Сопряженное число - вариант {}".format(var))
                print("n{} = {}\n".format(line[1], num))
                print("a = p{}: {}\n".format(len(str(gcd_num)), gcd_num))
                print("b = p{}: {}\n".format(len(str(tmp)), tmp))
                check = tmp * gcd_num
                print("Проверка\na * b = {}".format(check))
        elif line != '\n':
            var = line[0]

